# Importing libraries/packages

In [2]:
import pandas as pd
import numpy as np

# Dataframe from lists

In [34]:
names = ['Kenzo Tenma', 'Johan Liebert', 'Nina Fortner', 'Franz Bonaparta', 'Wolfgang Grimmer', 'Heinrich Lunge']
monster = pd.DataFrame(names)
monster

                  0
0       Kenzo Tenma
1     Johan Liebert
2      Nina Fortner
3   Franz Bonaparta
4  Wolfgang Grimmer
5    Heinrich Lunge

In [22]:
monster.index # to give the indices

RangeIndex(start=0, stop=6, step=1)

In [35]:
# rename the single column
# use the .columns attribute and inpute a list, whose length is based on the number of columns
monster.columns = ['names']
monster

              names
0       Kenzo Tenma
1     Johan Liebert
2      Nina Fortner
3   Franz Bonaparta
4  Wolfgang Grimmer
5    Heinrich Lunge

In [36]:
# add new column
# this one is through the use of square brackets 
# square brackets also select a particular column
monster['age'] = [37, 20, 20, 68, 41, 50] # idk how old lunge is
monster

              names  age
0       Kenzo Tenma   37
1     Johan Liebert   20
2      Nina Fortner   20
3   Franz Bonaparta   68
4  Wolfgang Grimmer   41
5    Heinrich Lunge   50

In [26]:
# selecting a column via square brackets 
monster['age']

0    37
1    20
2    20
3    68
4    41
5    50
Name: age, dtype: int64

In [27]:
# this one can be done too
# kinda like an attribute
monster.age

0    37
1    20
2    20
3    68
4    41
5    50
Name: age, dtype: int64

In [37]:
# add new column 
monster['occupation'] = ['neurosurgeon', 'NA', 'law student', 'hotel manager', 'investigative journalist', 'detective']
# Tenma is technically a fugitive on the run and is therefor not practicing, and while Bonaparta is a psychiatrist/pshychologist, he also stopped his practice because *spoilers*
# it wouldn't be alright saying "law student" is an occupation, but ehh

monster

              names  age                occupation
0       Kenzo Tenma   37              neurosurgeon
1     Johan Liebert   20                        NA
2      Nina Fortner   20               law student
3   Franz Bonaparta   68             hotel manager
4  Wolfgang Grimmer   41  investigative journalist
5    Heinrich Lunge   50                 detective

In [38]:
# renaming column via the column attribute 
monster.columns = ['Names', 'Age', 'Occupation']
monster

              Names  Age                Occupation
0       Kenzo Tenma   37              neurosurgeon
1     Johan Liebert   20                        NA
2      Nina Fortner   20               law student
3   Franz Bonaparta   68             hotel manager
4  Wolfgang Grimmer   41  investigative journalist
5    Heinrich Lunge   50                 detective

In [30]:
# adding a new row
# there's a longer way of doing this (via dictionary)
# and a simpler and easier way to do 
# anyway, longer way, make a dictionary, whose keys are the column names, and the values are the values in the row to be inserted
new_row = {'Name': 'Eva Heinemann', 'Age':39, 'Occupation': 'interior designer'}
new_row

{'Name': 'Eva Heinemann', 'Age': 39, 'Occupation': 'interior designer'}

In [21]:
len(monster)

7

In [20]:
# append this new row to the dataframe through the dataframe's index (via loc)
# syntax is this: dataframe.loc[index]
# where index is len(dataframe)

monster.loc[len(monster)] = new_row
monster

                  0
0       Kenzo Tenma
1     Johan Liebert
2      Nina Fortner
3   Franz Bonaparta
4  Wolfgang Grimmer
5    Heinrich Lunge
6               NaN

In [39]:
# the shorter way is just adding list 
monster.loc[7] = ['Roberto', 'NA', 'assassin']
monster

              Names Age                Occupation
0       Kenzo Tenma  37              neurosurgeon
1     Johan Liebert  20                        NA
2      Nina Fortner  20               law student
3   Franz Bonaparta  68             hotel manager
4  Wolfgang Grimmer  41  investigative journalist
5    Heinrich Lunge  50                 detective
7           Roberto  NA                  assassin

# Dataframe from dictionary

In [6]:
Potter = {"Professor":["Quirrel", "Flitwick", "Sprout", "Sybil", "Dippet", "Lupin", "Snape", "Dumbledor", "Moody"],
         "Students":['Harry', 'Hermione', 'Ronald', 'Fred', 'George', 'Ginny', 'Cedric', 'Draco', 'Susan']}

Potter = pd.DataFrame(Potter, columns = ["Professor", "Students"]) # columns should correspond to the dict keys!
Potter

   Professor  Students
0    Quirrel     Harry
1   Flitwick  Hermione
2     Sprout    Ronald
3      Sybil      Fred
4     Dippet    George
5      Lupin     Ginny
6      Snape    Cedric
7  Dumbledor     Draco
8      Moody     Susan

In [7]:
# or just skip the columns argument in pd.DataFrame()

Potter = {"Professor":["Quirrel", "Flitwick", "Sprout", "Sybil", "Dippet", "Lupin", "Snape", "Dumbledor", "Moody"],
         "Students":['Harry', 'Hermione', 'Ronald', 'Fred', 'George', 'Ginny', 'Cedric', 'Draco', 'Susan']}

Potter = pd.DataFrame(Potter)
Potter

   Professor  Students
0    Quirrel     Harry
1   Flitwick  Hermione
2     Sprout    Ronald
3      Sybil      Fred
4     Dippet    George
5      Lupin     Ginny
6      Snape    Cedric
7  Dumbledor     Draco
8      Moody     Susan

Importing data

When there’s a pre-existing dataset, typically, it is collected in a tabular form, created and edited through spreadsheets. This data is usually saved in either .xlsx or .csv formats and can be accessed on a local machine or through a repository (like GitHub)


from local file

In [11]:
# accessing locally
# used pd.read_csv() (for csv files), a function within pandas (which was nicknamed to pd earlier)
# saving the csv file as an object
# the location of the file in this machine is wrapped into a string, but with an r before the first


iris = pd.read_csv(r"https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

 From a repository

In [12]:
# accessing through a repository
# find the “raw” button on GitHub and then copy and paste the url as  string
iris = pd.read_csv("https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

Some attributes and methods

Since a dataframe is two dimensional, it has an attribute called shape which gives its dimension (rowsxcolumns)

In [14]:
iris.shape

(150, 5)

 The columns can be listed

In [15]:
iris.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

The data types of the variables (columns) is given by dtypes

In [16]:
iris.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

Dataframes can contain many rows, which are not displayed for obvious reason. To the first few rows, use the .head()  method (the opposite is the .tail() method)

In [17]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [19]:
iris.head(7)  # 1st 7 rows

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa

In [20]:
iris.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

 Other methods/attributes similar to .dtypes are .info() and .describeI()

In [21]:
# the .info() gives more details compared to .dtypes attribute
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [22]:
 # the .describe() method already “cheats”, giving the summary statistics
# through in this case, only the numerics are given their summary statistics
# .describe() for categoricals will be deal with on a later lesson
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [29]:
# for categorical values, to get just the categories, use pd.Series.unique()
# through this can be used for numbers as well

print(iris['variety'].unique())

# this can be saved as a list
variety = list(iris.variety.unique())
print(variety)

['Setosa' 'Versicolor' 'Virginica']
['Setosa', 'Versicolor', 'Virginica']